{
  "common": {
    "name": "sun2000",
    "version": "2.3.0",
    "news": {
      "2.3.0": {
        "en": "new release for npm migrates to Trusted Publishing",
        "de": "neue Veröffentlichung für npm migriert Trusted Publishing",
        "ru": "новый релиз для npm перенесен в Trusted Publishing",
        "pt": "nova versão para npm migra para a publicação confiável",
        "nl": "nieuwe release voor npm-migraties naar Trusted Publishing",
        "fr": "nouvelle version pour npm migre vers Trusted Publishing",
        "it": "nuovo rilascio per npm migra a Trusted Publishing",
        "es": "nueva versión para npm migrates a Trusted Publishing",
        "pl": "nowa wersja dla migratów npm do zaufanej publikacji",
        "uk": "новий реліз для npm migrats для Trusted Publishing",
        "zh-cn": "npm 的新版本迁移到信任出版"
      },
      "2.2.1-alpha.0": {
        "en": "inverter control: add same state for startup and shutdown an inverter [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\nfix: Device status name has been corrected [#202](https://github.com/bolliy/ioBroker.sun2000/pull/202)\nadd undocumented device status `Shutdown: End of the ESS discharge process` \nemma control: new state ` emma.control.battery.ESSControlMode`. You can now configure EMMA with TOU-mode (Time of Use) to charge the battery from grid. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nif an Emma is installed, some control states of the inverter are deactivated (read only). Mainly for the grid settings.\ndeprecated control states have been removed.\na workaround for issue [#582](https://github.com/yaacov/node-modbus-serial/issues/582) of node-modbus-serial has been implemented.",
        "de": "inverter-Steuerung: Fügen Sie den gleichen Zustand für Start und Abschaltung eines Inverters [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199) hinzu\nbehoben: Gerätestatusname wurde korrigiert [#202](https://github.com/bolliy/ioBroker.sun2000/pull/202)\n`Shutdown: Ende des ESS-Entladungsvorgangs`\nemma control: new state ` emma.control.battery.ESSControlMode`. Sie können nun EMMA mit TOU-Modus (Time of Use) konfigurieren, um den Akku aus dem Netz zu laden. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nwenn eine Emma installiert ist, werden einige Steuerzustände des Wechselrichters deaktiviert (nur lesen). Hauptsächlich für die Netzeinstellungen.\ndeprekierte steuerzustände wurden entfernt.\nein workaround für ausgabe [#582](https://github.com/yaacov/node-modbus-serial/issues/582) von node-modbus-serial wurde implementiert.",
        "ru": "инверторное управление: добавьте то же состояние для запуска и отключения инвертора [#199] (https://github.com/bolliy/ioBroker.sun2000/issues/199)\nисправление: имя статуса устройства было исправлено [#202] (https://github.com/bolliy/ioBroker.sun2000/pull/202)\nдобавить незарегистрированный статус устройства «Shutdown: End of the ESS discharge process»\nemma control: emma.control.battery.ESSControlMode. Теперь вы можете настроить EMMA с режимом TOU (Время использования) для зарядки батареи из сетки. [#200] (https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nесли установлена Эмма, некоторые контрольные состояния инвертора деактивируются (только чтение). В основном для настроек сетки.\nустаревшие контрольные штаты были удалены.\nбыл реализован обходной путь для выпуска [#582] (https://github.com/yaacov/node-modbus-serial/issues/582) node-modbus-serial.",
        "pt": "controle do inversor: adicione o mesmo estado para iniciar e desligar um inversor [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\ncorreção: o nome do estado do dispositivo foi corrigido [#202] (https://github.com/bolliy/ioBroker.sun2000/pull/202)\nadicionar status do dispositivo não documentado `Shutdown: Fim do processo de descarga do ESS'\nemma control: novo estado `emma.control.battery.ESSControlMode`. Agora você pode configurar o EMMA com o modo TOU (Time of Use) para carregar a bateria da grade. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nse uma Emma estiver instalada, alguns estados de controle do inversor são desativados (apenas lidos). Principalmente para as configurações da grade.\nos estados de controlo desactualizados foram removidos.\numa solução alternativa para o problema [#582](https://github.com/yaacov/node-modbus-serial/issues/582) do nó-modbus-serial foi implementada.",
        "nl": "inverter control: voeg dezelfde status toe voor het opstarten en afsluiten van een inverter [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\nfix: De status van het apparaat is gecorrigeerd [#202](https://github.com/bolliy/ioBroker.sun2000/pull/202)\nstatus van niet-gedocumenteerd apparaat toevoegen: Afsluiten: Einde van het ESS-ontladingsproces\nemma control: nieuwe staat  U kunt nu EMMA configureren met de TOU-modus (Time of Use) om de batterij op te laden van het net. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nals een Emma is geïnstalleerd, worden sommige controletoestanden van de omvormer gedeactiveerd (alleen lezen). Vooral voor de rasterinstellingen.\nverouderde controlestaten zijn verwijderd.\ner is een oplossing gevonden voor nummer [#582](https://github.com/yaacov/node-modbus-serial/issues/582) van node-modbus-serial.",
        "fr": "contrôle de l'onduleur: ajouter le même état pour le démarrage et l'arrêt d'un onduleur [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\ncorrection : le nom de l'état du périphérique a été corrigé [#202](https://github.com/bolliy/ioBroker.sun2000/pull/202)\najouter l'état de l'appareil sans papiers `Shutdown: Fin du processus de décharge ESS'\ncontrôle emma: nouvel état ` emma.control.battery.ESSControlMode`. Vous pouvez maintenant configurer EMMA en mode TOU (Time of Use) pour charger la batterie à partir de la grille. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nsi une Emma est installée, certains états de contrôle de l'onduleur sont désactivés (lisez seulement). Principalement pour les paramètres de la grille.\nles états de contrôle dépréciés ont été supprimés.\nune solution de rechange pour l'émission [#582](https://github.com/yaacov/node-modbus-serial/issues/582) de nœud-modbus-serial a été mise en œuvre.",
        "it": "controllo inverter: aggiungere lo stesso stato per l'avvio e l'arresto di un inverter [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\nfix: Il nome dello stato del dispositivo è stato corretto [#202](https://github.com/bolliy/ioBroker.sun2000/pull/202)\naggiungere lo stato del dispositivo non documentato `Shutdown: Fine del processo di scarico ESS`\ncontrollo emma: nuovo stato ` emma.control.battery.ESSControlMode`. È ora possibile configurare EMMA con TOU-mode (Time of Use) per caricare la batteria dalla rete. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nse viene installata una Emma, alcuni stati di controllo dell'inverter sono disattivati (leggi solo). Principalmente per le impostazioni della griglia.\nstati di controllo deprecati sono stati rimossi.\nè stato implementato un workaround per il numero [#582](https://github.com/yaacov/node-modbus-serial/issues/582) di node-modbus-serial.",
        "es": "control inverter: añadir el mismo estado para iniciar y cerrar un inverter [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\nfijado: Se ha corregido el nombre del estado de los dispositivos [#202](https://github.com/bolliy/ioBroker.sun2000/pull/202)\nañadir estado de dispositivo no documentado `Shutdown: Final del proceso de descarga ESS`\nemma control: nuevo estado ` emma.control.battery.ESSControlMode`. Ahora puede configurar EMMA con TOU-mode (Time of Use) para cargar la batería de la red. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nsi se instala una Emma, se desactivan algunos estados de control del inversor (sólo lectura). Principalmente para la configuración de la red.\nestados de control deprecatados han sido eliminados.\na workaround for issue [#582](https://github.com/yaacov/node-modbus-serial/issues/582) of node-modbus-serial has been implemented.",
        "pl": "inverter control: add same state for startup and shutdown an inverter [# 199] (https: / / github.com / bolliy / ioBroker.sun2000 / issues / 199)\nfix: Nazwa statusu urządzenia została poprawiona [# 202] (https: / / github.com / bolliy / ioBroker.sun2000 / pull / 202)\ndodać nieudokumentowany status urządzenia \"Wyłączenie: koniec procesu rozładowania ESS\"\nemma control: New state 'emma.control.battery.ESSControlMode'. Można teraz skonfigurować EMMA z TOU- mode (Time of Use), aby naładować baterię z siatki. [# 200] (https: / / github.com / bolliy / ioBroker.sun2000 / discussions / 200)\njeśli zainstalowana jest Emma, niektóre stany sterujące inwertera są wyłączone (tylko do odczytu). Głównie dla ustawień siatki.\nusunięto zdepregatowane stany kontrolne.\na workaround for issue [# 582] (https: / / github.com / yaacov / node- modbus- serial / issues / 582) of node- modbus- serial został wdrożony.",
        "uk": "контроль інвертора: додати однаковий стан для запуску та відключення інвертора [#199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\nвиправлено: Назва стану пристрою було виправлено [#202] (https://github.com/bolliy/ioBroker.sun2000/pull/202)\nдодати недокументований статус пристрою `Пошук: кінець процесу розряду ESS\nемма управління: новий стан ` emma.control.battery.ESSControlMode`. Ви можете налаштувати EMMA з TOU-mode (Time of Use) для зарядки акумулятора з сітки. [#200](https://github.com/bolliy/ioBroker.sun2000/discussions/200)\nякщо встановлений Емма, деактивуються деякі стани управління інвертором (прочитати тільки). В основному для налаштування сітки.\nвилучені стани керування.\n[#582](https://github.com/yaacov/node-modbus-serial/issues/582) вузла-modbus-serial.",
        "zh-cn": "反转器控制:为启动和关闭添加相同状态的反转器[199](https://github.com/bolliy/ioBroker.sun2000/issues/199)\n固定: 设备状态名称已更正 [# 202] (https://github.com/bolliy/ioBroker.sun2000/pul/202)\n添加无文件设备状态“关闭:ESS放电过程结束”\nemma控制:新状态`emma.control.battery.ESS Control Mode'. 您现在可以用 TOU- mode( 使用时间) 配置 EMMA 从电网中充电 。 [# 200] (https://github.com/bolliy/ioBroker.sun2000/discussions/200)\n如果安装了Emma,反转器的某些控制状态就会失效(只读). 主要用于网格设置.\n贬值的控制状态已被取消.\n已落实了节点-modbus-serial[#582](https://github.com/yaacov/node-modbus-serial/issues/582)的工作."
      },
      "2.2.0": {
        "en": "dependency and configuration updates\nnew state `meter.derived.signConventionForPowerFeed-in` sign of meter.activePower that is currently being fed into the power grid\nnew state `meter.derived.feed-inPower` electric power that is supplied to a grid (\"fed in\")",
        "de": "abhängigkeits- und konfigurationsupdates\nneuer Zustand `meter.derived.signConventionForPowerFeed-in` Zeichen von meter.active Strom, der derzeit in das Stromnetz eingespeist wird\nneue Zustand `meter.derived.feed-inPower` elektrische Leistung, die einem Netz zugeführt wird (\"fed in\")",
        "ru": "обновления зависимостей и конфигурации\nновый государственный знак «meter.derived.signConventionForPowerFeed-in» Мощность, которая в настоящее время подается в электросеть\nэлектрическая мощность нового состояния «meter.derived.feed-inPower», которая подается в сеть («питается в»)",
        "pt": "atualizações de dependência e configuração\nnovo estado `meter.derived.signConventionForPowerFeed-in` sinal do medidor.active Energia que está sendo alimentada na rede de energia\nnovo estado `meter.derived.feed-inPower` energia elétrica que é fornecida a uma grade (\"feed in\")",
        "nl": "afhankelijkheid en configuratie-updates\nnieuwe staat  Energie die momenteel wordt gevoed in het elektriciteitsnet\nnieuwe toestand ",
        "fr": "mises à jour de la dépendance et de la configuration\nnouvel état `meter.derived.signConventionForPowerFeed-in` signe de meter.active Puissance qui est actuellement introduite dans le réseau électrique\nnouvel état `meter.derived.feed-inPower` électricité qui est fourni à un réseau (\"feed in\")",
        "it": "aggiornamenti di dipendenza e configurazione\nnuovo stato `meter.derived.signConventionForPowerFeed-in` segno di metro.active Potenza che sta attualmente alimentando nella rete elettrica\nnuovo stato `meter.derived.feed-inPower` potere elettrico che viene fornito a una griglia (\"fed in\")",
        "es": "actualizaciones de dependencia y configuración\nnuevo estado `meter.derived.signConventionForPowerFeed-in` signo de medidor.active Potencia que actualmente está siendo alimentada en la red eléctrica\nnuevo estado `meter.derived.feed-inPower` energía eléctrica que se suministra a una red (\"fed in\")",
        "pl": "aktualizacje zależności i konfiguracji\nnowy stan 'meter.derived.signConventionForPowerFeed- in' znak meter.active Energia zasilana obecnie do sieci energetycznej\nnowy stan 'meter.derived.feed-inPower' energia elektryczna, która jest dostarczana do sieci (\"karmiona w\")",
        "uk": "оновлення залежності та конфігурації\nновий стан `meter.derived.signConventionForPowerFeed-in` знак лічильника.active Потужність, яка в даний час вдається в електромережу\nновий стан `meter.derived.feed-inPower` електрична потужність, яка подається в сітку (\"fed in\")",
        "zh-cn": "依赖和配置更新\n新的状态“ 公尺” 。 生成。 签署 Convention ForPowerFeed- in' sign of meter. 活动 目前输入电网的电力\n新状态“ met. entered. feed-inpower” 供电给电网(“ feeded in”)"
      },
      "2.1.1": {
        "en": "dependency and configuration updates\nfix: adjust event value limits based on usableSurplus parameters\nfix: swap register values for power consumption in Emma driver #190\nemma: improve power calculation with exponential moving average in EmmaCharger\nupdate surplus power state definitions and deprecate old identifiers",
        "de": "abhängigkeits- und konfigurationsupdates\nfix: Event-Wert-Grenze basierend auf nutzbar Überschüssige Parameter\nfix: Swap-Registerwerte für den Stromverbrauch in Emma Treiber #190\nemma: Leistungsberechnung mit exponentiellem Bewegungsmittel in EmmaCharger verbessern\naktualisierung der überschussstrom-zustandsdefinitionen und abschreibung alter kennungen",
        "ru": "обновления зависимостей и конфигурации\nисправление: корректировка предельных значений событий на основе пригодных для использования Дополнительные параметры\nисправление: значения регистра свопов для энергопотребления в драйвере Emma #190\nemma: улучшите расчет мощности с экспоненциальной скользящей средней в EmmaCharger\nобновить определения состояния избыточной мощности и обесценить старые идентификаторы",
        "pt": "atualizações de dependência e configuração\ncorreção: ajustar os limites do valor do evento com base no utilizável Parâmetros do excedente\ncorreção: valores de registro de swap para consumo de energia em Emma driver #190\nemma: melhorar o cálculo de potência com média móvel exponencial em EmmaCharger\natualizar definições de estado de potência excedente e depreciar identificadores antigos",
        "nl": "afhankelijkheid en configuratie-updates\nfix: aanpassen gebeurtenis waarde limieten op basis van bruikbaar Overschotparameters\nfix: swap register waarden voor energieverbruik in Emma driver #190\nemma: verbeteren van de stroomberekening met exponentieel bewegend gemiddelde in EmmaCharger\nde definitie van overtollige vermogenstoestand bij te werken en oude identificatienummers te schrappen",
        "fr": "mises à jour de la dépendance et de la configuration\nfix: ajuster les limites de valeur d'événement en fonction de la valeur utilisable Paramètres excédentaires\nfix: valeurs de registre d'échange pour la consommation d'énergie en Emma driver #190\nemma: améliorer le calcul de la puissance avec la moyenne mobile exponentielle en EmmaCharger\nmettre à jour les définitions de l'état de puissance excédentaire et supprimer les anciens identifiants",
        "it": "aggiornamenti di dipendenza e configurazione\ncorrezione: regolare i limiti del valore dell'evento in base all'utilizzabile Parametri in eccesso\ncorrezione: swap valori di registro per il consumo di energia in Emma driver #190\nemma: migliorare il calcolo di potenza con una media mobile esponenziale in EmmaCharger\naggiornare le definizioni di stato di potenza eccedente e deprecare vecchi identificatori",
        "es": "actualizaciones de dependencia y configuración\nfijación: ajustar los límites de valor de evento basados en utilizables Parámetros adicionales\nfijado: cambiar los valores de registro para el consumo de energía en el controlador Emma #190\nemma: mejorar el cálculo de potencia con promedio de movimiento exponencial en EmmaCharger\nactualizar las definiciones de estado de excedente de energía y depreparar identificadores antiguos",
        "pl": "aktualizacje zależności i konfiguracji\nfix: dostosować wartości graniczne dla zdarzeń w oparciu o wartość użytkową Parametry nadwyżki\nfix: wartości rejestru swap dla zużycia energii w sterowniku Emma # 190\nemma: ulepszenie obliczania mocy przy zastosowaniu wykładniczej średniej ruchomej w EmmaCharger\naktualizacja definicji nadwyżek energii elektrycznej i deprecjacja starych identyfikatorów",
        "uk": "оновлення залежності та конфігурації\nвиправити: регулювати ліміти значення події на основі Параметри Surplus\nвиправити: значення swap для споживання енергії в машині Емма #190\nемма: поліпшення розрахунку потужності з постійним рухомим середнім в ЕммаКхаргер\nоновлення надлишок визначення стану живлення та депресувати старі ідентифікатори",
        "zh-cn": "依赖和配置更新\n固定:根据可用值调整事件值限制 盈余参数\n修补: Emma 驱动器中用电量的交换记录值 # 190\nemma: 改进电量计算, 以 Emmacourer 中的指数移动平均值\n更新剩余电源状态定义并折旧旧标识符"
      },
      "2.1.0": {
        "en": "emma: system time is being determined [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\ncontrol: add grid power scheduling functionality to inverter driver [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "de": "emma: Die Systemzeit wird bestimmt [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\nsteuerung: Netz-Leistungs-Scheduling-Funktionalität zum Wechselrichtertreiber hinzufügen [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "ru": "emma: системное время определяется [#179] (https://github.com/bolliy/ioBroker.sun2000/issues/179)\nуправление: добавьте функцию планирования мощности сети к драйверу инвертора [#176] (https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "pt": "emma: tempo do sistema está sendo determinado [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\ncontrol: add grid power screaming functionality to inverter driver [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "nl": "emma: de systeemtijd wordt bepaald [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\ncontrole: voeg net stroom planning functionaliteit aan omvormer driver [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "fr": "emma: le temps du système est déterminé [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\ncontrôle: ajouter la fonctionnalité de programmation du réseau au pilote d'onduleur [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "it": "emma: il tempo di sistema viene determinato [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\ncontrollo: aggiungere funzionalità di programmazione della griglia al driver inverter [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "es": "emma: El tiempo del sistema se determina [#179](https://github.com/bolliy/ioBroker.sun2000/issues/179)\ncontrol: añadir funcionalidad de programación de energía de red al controlador inverter [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "pl": "emma: ustala się czas systemowy [# 179] (https: / / github.com / bolliy / ioBroker.sun2000 / issues / 179)\ncontrol: add grid Power Scheduling Functional to inverter driver [# 176] (https: / / github.com / bolliy / ioBroker.sun2000 / issues / 176)",
        "uk": "emma: час системи визначається [#179](https://github.com/bolliy/ioBroker.sun2000/products/179)\ncontrol: add power scheduling features to inverter драйвер [#176](https://github.com/bolliy/ioBroker.sun2000/issues/176)",
        "zh-cn": "emma:系统时间正在确定 [# 179] (https://github.com/bolliy/ioBroker.sun2000/issues/179)\n控制:向反向驱动器添加电网电源调度功能[#176](https://github.com/bolliy/ioBroker.sun2000/issues/1976)"
      },
      "2.0.0": {
        "en": "add support for chargers via Emma and save the data in the charger path #171\nEstablish data consistency between meter.activePower and the power of the meter phases #174\nallows `control.battery.chargeFromGridFunction` when using the Emma\nbreaking change: \nthe value `sun2000.x.inverter.x.battery.runningStatus` is saved as a number. The translated value (such as STANDBY, RUNNING etc.) is stored in the path sun2000.x.inverter.x.battery.derived",
        "de": "unterstützung für Ladegeräte über Emma hinzufügen und die Daten im Ladepfad #171 speichern\nDatenkonsistenz zwischen meter.activePower und der Leistung der Zählerphasen #174 einstellen\nerlaubt `control.battery.chargeFromGridFunction` bei Verwendung der Emma\nänderung:\nder Wert `sun2000.x.inverter.x.battery.runningStatus` wird als Nummer gespeichert. Der übersetzte Wert (wie STANDBY, RUNNING etc.) wird im Pfad sun2000.x.inverter.x.battery.derived gespeichert",
        "ru": "добавьте поддержку зарядных устройств через Emma и сохраните данные в пути зарядного устройства #171\nУстановить согласованность данных между meter.activePower и мощностью фаз счетчика #174\nпозволяет «control.battery.chargeFromGridFunction» при использовании Emma\nпреодоление изменений:\nзначение 'sun2000.x.inverter.x.battery.runningStatus' сохраняется в виде числа. Переведенное значение (например, STANDBY, RUNNING и т.д.) сохраняется в пути sun2000.x.inverter.x.battery.derived",
        "pt": "adicionar suporte para carregadores via Emma e salvar os dados no caminho do carregador #171\nEstabelecer a consistência dos dados entre a potência do medidor e a potência das fases do medidor #174\npermite `control.battery.chargeFromGridFunction` ao usar a Emma\nalteração de quebra:\no valor `sun2000.x.inverter.x.battery.runningStatus` é salvo como um número. O valor traduzido (como STADBY, RUNNING etc.) é armazenado no caminho sun2000.x.inverter.x.battery.derived",
        "nl": "ondersteuning voor opladers toevoegen via Emma en de gegevens opslaan in het opladerpad #171\nVaststelling van gegevens consistentie tussen meter.activePower en het vermogen van de meter fasen #174\nstaat control.battery.chargeFromGridFunction\nbreek verandering:\nde waarde  De vertaalde waarde (zoals STANDBY, RUNNING etc.) wordt opgeslagen in het pad sun2000.x.inverter.x.battery. afgeleide",
        "fr": "ajouter le support pour les chargeurs via Emma et enregistrer les données dans le chemin de chargeur #171\nÉtablir la cohérence des données entre le compteur.activePower et la puissance des phases du compteur #174\npermet `control.battery.chargeFromGridFunction` lors de l'utilisation de l'Emma\nrupture du changement:\nla valeur `sun2000.x.inverter.x.battery.runningStatus` est enregistrée en nombre. La valeur traduite (comme STANDBY, RUNNING, etc.) est stockée dans le chemin sun2000.x.inverter.x.battery.derived",
        "it": "aggiungere supporto per i caricatori tramite Emma e salvare i dati nel percorso del caricabatterie #171\nStabilire la consistenza dei dati tra metro.activePower e la potenza delle fasi metro #174\npermette `control.battery.chargeFromGridFunction` quando si utilizza Emma\ncambiamento di rottura:\nil valore `sun2000.x.inverter.x.battery.runningStatus` viene salvato come numero. Il valore tradotto (come STANDBY, RUNNING ecc.) è memorizzato nel percorso sun2000.x.inverter.x.battery.derived",
        "es": "añadir soporte para los cargadores a través de Emma y guardar los datos en la ruta del cargador #171\nEstablecer la coherencia de los datos entre el medidor.activePower y la potencia de las fases del medidor #174\npermite 'control.battery.chargeDesdeGridFunction' al usar Emma\ncambio de ruptura:\nel valor `sun2000.x.inverter.x.battery.runningStatus` se guarda como un número. El valor traducido (como STANDBY, RUNNING etc.) se almacena en el camino sun2000.x.inverter.x.battery.derived",
        "pl": "dodaj obsługę ładowarek przez Emmę i zapisz dane w ścieżce ładowarki # 171\nUstanowienie spójności danych między miernikiem. ActivePower i mocą faz miernika # 174\npozwala 'control.battery.chargeFromGridFunction' przy użyciu Emmy\nzmiana\nwartość 'sun2000.x.inverter.x.battery.runningStatus' jest zapisywana jako liczba. Wartość przetłumaczona (taka jak STANDBY, RUNNING itp.) jest przechowywana w ścieżce Sun2000.x.inverter.x.battery.deriver",
        "uk": "додати підтримку зарядних пристроїв через Емма і зберегти дані в шляху зарядного пристрою #171\nВстановити консистенцію даних між лічильником.activePower і потужністю метрових фаз #174\nдозволяє `control.battery.chargeЗ альбомуGridFunction` при використанні Емма\nзміна розриву:\nзначення `sun2000.x.inverter.x.battery.runningStatus` зберігається як номер. Перекладено значення (наприклад, STANDBY, RUNNING тощо) зберігається в шляху сонце2000.x.inverter.x.battery.derived",
        "zh-cn": "通过 Emma 添加对充电器的支持, 并保存充电器路径 # 171 中的数据\n在 meter.activePower和meter阶段的功率之间建立数据一致性 #174\n在使用 Emma 时允许“ control. battery. force from GridFunction ”\n断开更改 :\n将“sun2000.x.inverter.x.battery.running Status”作为数字保存。 翻译值( 如 STANDBY, RUNNING 等) 存储在路径 sun2000.x.inverter.x.battery. 衍生"
      },
      "1.5.0": {
        "en": "update dependencies\nfix: surplus power during battery discharge\ncontrol: new control value `sun2000.0.control.usableSurplus.bufferHysteresis`",
        "de": "aktualisierung der abhängigkeiten\nfix: überschussleistung während der batterieentladung\nsteuerung: neuer Steuerwert `sun2000.0.control.usableSurplus.bufferHysteresis`",
        "ru": "обновление зависимостей\nисправление: избыточная мощность во время разрядки батареи\nконтроль: новое значение управления 'sun2000.0.control.usableSurplus.bufferHysteresis'",
        "pt": "dependências\ncorreção: energia excedente durante a descarga da bateria\ncontrol: novo valor de controle `sun2000.0.control.usableSurplus.bufferHysteresis`",
        "nl": "afhankelijkheden bijwerken\nfix: overtollig vermogen tijdens batterijontlading\ncontrole: nieuwe controlewaarde ",
        "fr": "mettre à jour les dépendances\nfix: puissance excédentaire pendant la décharge de la batterie\ncontrôle: nouvelle valeur de contrôle `sun2000.0.control.usableSurplus.bufferHystérésis`",
        "it": "aggiornamento dipendenze\nfix: potenza in eccesso durante la scarica della batteria\ncontrollo: nuovo valore di controllo `sun2000.0.control.usableSurplus.bufferHysteresis`",
        "es": "dependencias de actualización\nfijación: superávit durante la descarga de la batería\ncontrol: nuevo valor de control `sun2000.0.control.usableSurplus.bufferHysteresis`",
        "pl": "aktualizacji zależności\nfix: nadwyżka mocy podczas rozładowania akumulatora\ncontrol: nowa wartość kontrolna 'sun2000.0.control.usableSurplus.buverHysteresis'",
        "uk": "оновлення залежності\nвиправити: надлишок живлення при розряді акумулятора\n`sun2000.0.control.usableSurplus.bufferHysteresis`",
        "zh-cn": "更新依赖关系\n固定:电池放电时的剩余功率\n控制: 新的控制值 `sun2000.control.ulySurplus.bufferHysteresis'"
      }
    },
    "titleLang": {
      "en": "Huawei sun2000 inverter",
      "de": "Huawei sun2000 Wechselrichter",
      "ru": "Huawei sun2000 inverter",
      "pt": "Huawei sun2000 inverter",
      "nl": "Huawei sun2000 inverter",
      "fr": "Huawei sun2000 inverter",
      "it": "Huawei sun2000 inverter",
      "es": "Huawei sun2000 inverter",
      "pl": "Huawei sun2000 inverter",
      "uk": "Huawei sun2000 inverter",
      "zh-cn": "Huawei sun2000 inverter"
    },
    "desc": {
      "en": "To read and write data from up to 5 Huawei SUN2000 inverters and LUNA2000 batteries via Modbus TCP. Third-party devices can be integrated via the modbus proxy.",
      "de": "Zum Lesen und Schreiben von Daten von bis zu 5 Huawei SUN2000 Wechselrichtern und LUNA2000 Batterien über Modbus TCP. Drittgeräte können über den Modbus Proxy integriert werden.",
      "ru": "Прочитать и писать данные до 5 инверторов Huawei SUN2000 и батарей LUNA2000 через Modbus TCP. Сторонние устройства могут быть интегрированы через modbus proxy.",
      "pt": "Para ler e escrever dados de até 5 inversores Huawei SUN2000 e baterias LUNA2000 via Modbus TCP. Dispositivos de terceiros podem ser integrados através do proxy modbus.",
      "nl": "Gegevens lezen en schrijven van maximaal 5 Huawei SUN2000 omvormers en LUNA2000 batterijen via Modbus TCP. De apparaten van derden kunnen worden geïntegreerd via de modbus proxy.",
      "fr": "Pour lire et écrire des données de jusqu'à 5 onduleurs Huawei SUN2000 et batteries LUNA2000 via Modbus TCP. Les périphériques tiers peuvent être intégrés via le proxy modbus.",
      "it": "Per leggere e scrivere dati da un massimo di 5 inverter Huawei SUN2000 e batterie LUNA2000 tramite Modbus TCP. I dispositivi di terze parti possono essere integrati tramite il proxy modbus.",
      "es": "Para leer y escribir datos de hasta 5 inversores Huawei SUN2000 y baterías LUNA2000 a través de Modbus TCP. Los dispositivos de terceros se pueden integrar a través del modbus proxy.",
      "pl": "Do odczytu i zapisu danych z do 5 Huawei SUN2000 inwerterów i akumulatorów LUNA2000 za pośrednictwem Modbus TCP. Urządzenia trójstronne mogą być zintegrowane za pośrednictwem proxy modbus.",
      "uk": "Щоб читати та писати дані від 5 інверторів Huawei SUN2000 та батарей LUNA2000 через Modbus TCP. Сторонні пристрої можуть бути інтегровані через проксі модбуса.",
      "zh-cn": "通过Modbus TCP读取和写入最多5个Huawei SUN2000反转器和LUNA2000电池的数据。 第三方设备可以通过modbus代理集成."
    },
    "authors": [
      "bolliy <stephan@mante.info>"
    ],
    "keywords": [
      "huawei",
      "modbus",
      "sun2000",
      "luna2000",
      "inverter",
      "smartcharger",
      "sdongle"
    ],
    "tier": 2,
    "licenseInformation": {
      "license": "MIT",
      "link": "https://opensource.org/license/mit/",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "sun2000.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/bolliy/ioBroker.sun2000/main/admin/sun2000.png",
    "readme": "https://github.com/bolliy/ioBroker.sun2000/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "docs": {
      "en": [
        "docs/README.md"
      ]
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=0.18.1",
            "newVersion>0.18.1"
          ]
        },
        "title": {
          "en": "node.js 20.x or higher required",
          "de": "node.js 20.x oder höher erforderlich",
          "ru": "node.js 20.x или выше требуется",
          "pt": "node.js 20.x ou superior requerido",
          "nl": "node.js 20.x of hoger vereist",
          "fr": "node.js 20.x ou plus requis",
          "it": "node.js 20.x o superiore richiesto",
          "es": "node.js 20.x o superior requerido",
          "pl": "node.js 20,x lub wyższa wymagana",
          "uk": "node.js 20.x або вище потрібно",
          "zh-cn": "节点.js 20.x或更高"
        },
        "text": {
          "en": "Please try to stay current with your Node.js version because the support is limited in time. As of now all Node.js versions below 20.x are no longer supported. (End Of Life).",
          "de": "Bitte versuchen Sie die Node.js-Version aktuell zu halten, da die Unterstützung zeitlich begrenzt ist. Ab sofort werden alle Node.js Versionen unter 20.x nicht mehr unterstützt. (End Of Life).",
          "ru": "Пожалуйста, попытайтесь оставаться в курсе своей версии Node.js, потому что поддержка ограничена во времени. На данный момент все версии Node.js ниже 20.x больше не поддерживаются. (Конец жизни).",
          "pt": "Por favor, tente manter-se atual com sua versão Node.js porque o suporte é limitado a tempo. A partir de agora todas as versões do Node.js abaixo de 20.x não são mais suportadas. (End Of Life).",
          "nl": "Probeer om actueel te blijven met uw Node.js-versie omdat de ondersteuning beperkt is in de tijd. Vanaf nu worden alle Node.js versies onder 20.x niet meer ondersteund. (Einde van het leven).",
          "fr": "Veuillez essayer de rester à jour avec votre version Node.js car le support est limité dans le temps. Toutes les versions de Node.js sous 20.x ne sont plus prises en charge. (Fin de vie).",
          "it": "Si prega di cercare di rimanere corrente con la versione Node.js perché il supporto è limitato nel tempo. A partire da ora tutte le versioni Node.js inferiori a 20.x non sono più supportate. (End Of Life).",
          "es": "Por favor, trate de mantenerse actualizado con su versión Node.js porque el soporte es limitado en el tiempo. A partir de ahora todas las versiones Node.js debajo de 20.x ya no están soportadas. (End Of Life).",
          "pl": "Proszę spróbować pozostać na bieżąco z wersją Node.js ponieważ wsparcie jest ograniczone w czasie. Od teraz wszystkie wersje Node.js poniżej 20.x nie są już obsługiwane. (Koniec życia).",
          "uk": "Будь-ласка, будь ласка, намагайтеся постійно триматися з версією Node.js, оскільки підтримка обмежена в часі. Зараз всі версії Node.js нижче 20.x не підтримуються. (Для життя).",
          "zh-cn": "请尝试保留您的 Node.js 版本, 因为支持时间有限 。 到目前为止,20x以下的所有Node.js版本不再被支持. (寿终."
        },
        "level": "info",
        "buttons": [
          "agree",
          "cancel"
        ],
        "link": "https://github.com/bolliy/ioBroker.sun2000/wiki/Update-node.js",
        "linkText": {
          "en": "The node.js update procedure is described here.",
          "de": "Der Aktualisierungsvorgang für node.js wird hier beschrieben.",
          "ru": "Процедура обновления node.js описана здесь.",
          "pt": "O procedimento de atualização do node.js é descrito aqui.",
          "nl": "De updateprocedure voor node.js wordt hier beschreven.",
          "fr": "La procédure de mise à jour de node.js est décrite ici.",
          "it": "La procedura di aggiornamento di node.js è descritta qui.",
          "es": "El procedimiento de actualización de node.js se describe aquí.",
          "pl": "Procedura aktualizacji node.js jest opisana tutaj.",
          "uk": "Процедура оновлення node.js описана тут.",
          "zh-cn": "此处描述了 Node.js 更新过程。"
        }
      }
    ],
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://db3e5fdd0eb6d8d72f68cac7b0970180@o4506370651652096.ingest.sentry.io/4506371101818880"
      }
    }
  },
  "native": {
    "address": "",
    "port": 502,
    "modbusIds": "1",
    "updateInterval": 20,
    "sd_active": false,
    "sDongleId": "100",
    "timeout": 10000,
    "delay": 0,
    "connectDelay": 5000,
    "autoAdjust": true,
    "ms_active": false,
    "ms_address": "0.0.0.0",
    "ms_port": 502,
    "ms_log": false,
    "sl_meterId": 11,
    "ds_bu": true,
    "integration": 0
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": {
          "en": "Information",
          "de": "Informationen",
          "ru": "Информация",
          "pt": "Informação",
          "nl": "Informatie",
          "fr": "Information",
          "it": "Informazioni",
          "es": "Información",
          "pl": "Informacja",
          "uk": "Інформація",
          "zh-cn": "信息"
        },
        "role": "info"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "name": {
          "en": "device connected",
          "de": "Gerät angeschlossen"
        },
        "type": "boolean",
        "role": "indicator.connected",
        "read": true,
        "write": false,
        "desc": "Is the device connected?"
      }
    },
    {
      "_id": "info.ip",
      "type": "state",
      "common": {
        "name": {
          "en": "Device IP",
          "de": "Geräte IP"
        },
        "type": "string",
        "role": "indicator.ip",
        "read": true,
        "write": false,
        "desc": "Device IP address"
      }
    },
    {
      "_id": "info.port",
      "type": "state",
      "common": {
        "name": {
          "en": "Modbus port",
          "de": "Modbusport"
        },
        "type": "number",
        "role": "indicator.port",
        "read": true,
        "write": false,
        "desc": "Device modbus port"
      }
    },
    {
      "_id": "info.modbusIds",
      "type": "state",
      "common": {
        "name": {
          "en": "Modbus IDs of devices",
          "de": "Modbus IDs der Geräte"
        },
        "type": "string",
        "role": "indicator.id",
        "read": true,
        "write": false,
        "desc": "device modbus IDs"
      }
    },
    {
      "_id": "info.modbusUpdateInterval",
      "type": "state",
      "common": {
        "name": {
          "en": "modbus update interval",
          "de": "modbus Update Intervall"
        },
        "type": "number",
        "role": "value",
        "read": true,
        "write": false,
        "desc": "modbus update interval",
        "unit": "sec"
      }
    },
    {
      "_id": "info.modbusTimeout",
      "type": "state",
      "common": {
        "name": {
          "en": "modbus timeout",
          "de": "modbus timeout"
        },
        "type": "number",
        "role": "value",
        "read": true,
        "write": false,
        "desc": "modbus timeout",
        "unit": "ms"
      }
    },
    {
      "_id": "info.modbusDelay",
      "type": "state",
      "common": {
        "name": {
          "en": "modbus delay",
          "de": "modbus delay"
        },
        "type": "number",
        "role": "value",
        "read": true,
        "write": false,
        "desc": "delay between modbus requests",
        "unit": "ms"
      }
    },
    {
      "_id": "info.modbusConnectDelay",
      "type": "state",
      "common": {
        "name": {
          "en": "modbus connect delay",
          "de": "modbus connect delay"
        },
        "type": "number",
        "role": "value",
        "read": true,
        "write": false,
        "desc": "delay after modbus connected",
        "unit": "ms"
      }
    },
    {
      "_id": "info.JSONhealth",
      "type": "state",
      "common": {
        "name": {
          "en": "health information",
          "de": "Gesundheitsinformation"
        },
        "type": "string",
        "role": "indicator.alarm.health",
        "read": true,
        "write": false,
        "desc": "",
        "unit": ""
      }
    },
    {
      "_id": "info.modbusTcpServer",
      "type": "state",
      "common": {
        "name": {
          "en": "modbus server active",
          "de": "modbus Server aktiv"
        },
        "type": "boolean",
        "role": "value",
        "read": true,
        "write": false,
        "desc": "",
        "unit": ""
      }
    }
  ]
}
